MikroElektronika/core_packages/ARM/gcc_clang/def/hdsc/HC32L072PATA/mcu.h
typedef struct
{
    uint8_t RESERVED0[8];
    union
    {
        __IO uint32_t GAHBCFG;
        stc_usbfs_gahbcfg_field_t GAHBCFG_f;
    };
    union
    {
        __IO uint32_t GUSBCFG;
        stc_usbfs_gusbcfg_field_t GUSBCFG_f;
    };
    union
    {
        __IO uint32_t GRSTCTL;
        stc_usbfs_grstctl_field_t GRSTCTL_f;
    };
    union
    {
        __IO uint32_t GINTSTS;
        stc_usbfs_gintsts_field_t GINTSTS_f;
    };
    union
    {
        __IO uint32_t GINTMSK;
        stc_usbfs_gintmsk_field_t GINTMSK_f;
    };
    union
    {
        __IO uint32_t GRXSTSR;
        stc_usbfs_grxstsr_field_t GRXSTSR_f;
    };
    union
    {
        __IO uint32_t GRXSTSP;
        stc_usbfs_grxstsp_field_t GRXSTSP_f;
    };
    union
    {
        __IO uint32_t GRXFSIZ;
        stc_usbfs_grxfsiz_field_t GRXFSIZ_f;
    };
    uint8_t RESERVED8[20];
    __IO uint32_t CID;
    uint8_t RESERVED9[196];
    union
    {
        __IO uint32_t DIEPTXF1;
        stc_usbfs_dieptxf1_field_t DIEPTXF1_f;
    };
    union
    {
        __IO uint32_t DIEPTXF2;
        stc_usbfs_dieptxf2_field_t DIEPTXF2_f;
    };
    union
    {
        __IO uint32_t DIEPTXF3;
        stc_usbfs_dieptxf3_field_t DIEPTXF3_f;
    };
    union
    {
        __IO uint32_t DIEPTXF4;
        stc_usbfs_dieptxf4_field_t DIEPTXF4_f;
    };
    uint8_t RESERVED13[1772];
    union
    {
        __IO uint32_t DCFG;
        stc_usbfs_dcfg_field_t DCFG_f;
    };
    union
    {
        __IO uint32_t DCTL;
        stc_usbfs_dctl_field_t DCTL_f;
    };
    union
    {
        __IO uint32_t DSTS;
        stc_usbfs_dsts_field_t DSTS_f;
    };
    uint8_t RESERVED16[4];
    union
    {
        __IO uint32_t DIEPMSK;
        stc_usbfs_diepmsk_field_t DIEPMSK_f;
    };
    union
    {
        __IO uint32_t DOEPMSK;
        stc_usbfs_doepmsk_field_t DOEPMSK_f;
    };
    union
    {
        __IO uint32_t DAINT;
        stc_usbfs_daint_field_t DAINT_f;
    };
    union
    {
        __IO uint32_t DAINTMSK;
        stc_usbfs_daintmsk_field_t DAINTMSK_f;
    };
    uint8_t RESERVED20[20];
    union
    {
        __IO uint32_t DIEPEMPMSK;
        stc_usbfs_diepempmsk_field_t DIEPEMPMSK_f;
    };
    uint8_t RESERVED21[200];
    union
    {
        __IO uint32_t DIEPCTL0;
        stc_usbfs_diepctl0_field_t DIEPCTL0_f;
    };
    uint8_t RESERVED22[4];
    union
    {
        __IO uint32_t DIEPINT0;
        stc_usbfs_diepint0_field_t DIEPINT0_f;
    };
    uint8_t RESERVED23[4];
    union
    {
        __IO uint32_t DIEPTSIZ0;
        stc_usbfs_dieptsiz0_field_t DIEPTSIZ0_f;
    };
    __IO uint32_t DIEPDMA0;
    union
    {
        __IO uint32_t DTXFSTS0;
        stc_usbfs_dtxfsts0_field_t DTXFSTS0_f;
    };
    uint8_t RESERVED26[4];
    union
    {
        __IO uint32_t DIEPCTL1;
        stc_usbfs_diepctl1_field_t DIEPCTL1_f;
    };
    uint8_t RESERVED27[4];
    union
    {
        __IO uint32_t DIEPINT1;
        stc_usbfs_diepint1_field_t DIEPINT1_f;
    };
    uint8_t RESERVED28[4];
    union
    {
        __IO uint32_t DIEPTSIZ1;
        stc_usbfs_dieptsiz1_field_t DIEPTSIZ1_f;
    };
    __IO uint32_t DIEPDMA1;
    union
    {
        __IO uint32_t DTXFSTS1;
        stc_usbfs_dtxfsts1_field_t DTXFSTS1_f;
    };
    uint8_t RESERVED31[4];
    union
    {
        __IO uint32_t DIEPCTL2;
        stc_usbfs_diepctl2_field_t DIEPCTL2_f;
    };
    uint8_t RESERVED32[4];
    union
    {
        __IO uint32_t DIEPINT2;
        stc_usbfs_diepint2_field_t DIEPINT2_f;
    };
    uint8_t RESERVED33[4];
    union
    {
        __IO uint32_t DIEPTSIZ2;
        stc_usbfs_dieptsiz2_field_t DIEPTSIZ2_f;
    };
    __IO uint32_t DIEPDMA2;
    union
    {
        __IO uint32_t DTXFSTS2;
        stc_usbfs_dtxfsts2_field_t DTXFSTS2_f;
    };
    uint8_t RESERVED36[4];
    union
    {
        __IO uint32_t DIEPCTL3;
        stc_usbfs_diepctl3_field_t DIEPCTL3_f;
    };
    uint8_t RESERVED37[4];
    union
    {
        __IO uint32_t DIEPINT3;
        stc_usbfs_diepint3_field_t DIEPINT3_f;
    };
    uint8_t RESERVED38[4];
    union
    {
        __IO uint32_t DIEPTSIZ3;
        stc_usbfs_dieptsiz3_field_t DIEPTSIZ3_f;
    };
    __IO uint32_t DIEPDMA3;
    union
    {
        __IO uint32_t DTXFSTS3;
        stc_usbfs_dtxfsts3_field_t DTXFSTS3_f;
    };
    uint8_t RESERVED41[4];
    union
    {
        __IO uint32_t DIEPCTL4;
        stc_usbfs_diepctl4_field_t DIEPCTL4_f;
    };
    uint8_t RESERVED42[4];
    union
    {
        __IO uint32_t DIEPINT4;
        stc_usbfs_diepint4_field_t DIEPINT4_f;
    };
    uint8_t RESERVED43[4];
    union
    {
        __IO uint32_t DIEPTSIZ4;
        stc_usbfs_dieptsiz4_field_t DIEPTSIZ4_f;
    };
    __IO uint32_t DIEPDMA4;
    union
    {
        __IO uint32_t DTXFSTS4;
        stc_usbfs_dtxfsts4_field_t DTXFSTS4_f;
    };
    uint8_t RESERVED46[356];
    union
    {
        __IO uint32_t DOEPCTL0;
        stc_usbfs_doepctl0_field_t DOEPCTL0_f;
    };
    uint8_t RESERVED47[4];
    union
    {
        __IO uint32_t DOEPINT0;
        stc_usbfs_doepint0_field_t DOEPINT0_f;
    };
    uint8_t RESERVED48[4];
    union
    {
        __IO uint32_t DOEPTSIZ0;
        stc_usbfs_doeptsiz0_field_t DOEPTSIZ0_f;
    };
    __IO uint32_t DOEPDMA0;
    uint8_t RESERVED50[8];
    union
    {
        __IO uint32_t DOEPCTL1;
        stc_usbfs_doepctl1_field_t DOEPCTL1_f;
    };
    uint8_t RESERVED51[4];
    union
    {
        __IO uint32_t DOEPINT1;
        stc_usbfs_doepint1_field_t DOEPINT1_f;
    };
    uint8_t RESERVED52[4];
    union
    {
        __IO uint32_t DOEPTSIZ1;
        stc_usbfs_doeptsiz1_field_t DOEPTSIZ1_f;
    };
    __IO uint32_t DOEPDMA1;
    uint8_t RESERVED54[8];
    union
    {
        __IO uint32_t DOEPCTL2;
        stc_usbfs_doepctl2_field_t DOEPCTL2_f;
    };
    uint8_t RESERVED55[4];
    union
    {
        __IO uint32_t DOEPINT2;
        stc_usbfs_doepint2_field_t DOEPINT2_f;
    };
    uint8_t RESERVED56[4];
    union
    {
        __IO uint32_t DOEPTSIZ2;
        stc_usbfs_doeptsiz2_field_t DOEPTSIZ2_f;
    };
    __IO uint32_t DOEPDMA2;
    uint8_t RESERVED58[8];
    union
    {
        __IO uint32_t DOEPCTL3;
        stc_usbfs_doepctl3_field_t DOEPCTL3_f;
    };
    uint8_t RESERVED59[4];
    union
    {
        __IO uint32_t DOEPINT3;
        stc_usbfs_doepint3_field_t DOEPINT3_f;
    };
    uint8_t RESERVED60[4];
    union
    {
        __IO uint32_t DOEPTSIZ3;
        stc_usbfs_doeptsiz3_field_t DOEPTSIZ3_f;
    };
    __IO uint32_t DOEPDMA3;
    uint8_t RESERVED62[8];
    union
    {
        __IO uint32_t DOEPCTL4;
        stc_usbfs_doepctl4_field_t DOEPCTL4_f;
    };
    uint8_t RESERVED63[4];
    union
    {
        __IO uint32_t DOEPINT4;
        stc_usbfs_doepint4_field_t DOEPINT4_f;
    };
    uint8_t RESERVED64[4];
    union
    {
        __IO uint32_t DOEPTSIZ4;
        stc_usbfs_doeptsiz4_field_t DOEPTSIZ4_f;
    };
    __IO uint32_t DOEPDMA4;
    uint8_t RESERVED66[616];
    union
    {
        __IO uint32_t PCGCCTL;
        stc_usbfs_pcgcctl_field_t PCGCCTL_f;
    };
}M0P_USBFS_TypeDef;

typedef struct
{
    uint8_t RESERVED0[16];
    union
    {
        __IO uint32_t CR;
        stc_vc_cr_field_t CR_f;
    };
    union
    {
        __IO uint32_t VC0_CR;
        stc_vc_vc0_cr_field_t VC0_CR_f;
    };
    union
    {
        __IO uint32_t VC1_CR;
        stc_vc_vc1_cr_field_t VC1_CR_f;
    };
    union
    {
        __IO uint32_t VC0_OUT_CFG;
        stc_vc_vc0_out_cfg_field_t VC0_OUT_CFG_f;
    };
    union
    {
        __IO uint32_t VC1_OUT_CFG;
        stc_vc_vc1_out_cfg_field_t VC1_OUT_CFG_f;
    };
    union
    {
        __IO uint32_t IFR;
        stc_vc_ifr_field_t IFR_f;
    };
    uint8_t RESERVED6[296];
    union
    {
        __IO uint32_t VC2_CR;
        stc_vc_vc2_cr_field_t VC2_CR_f;
    };
    union
    {
        __IO uint32_t VC2_OUT_CFG;
        stc_vc_vc2_out_cfg_field_t VC2_OUT_CFG_f;
    };
}M0P_VC_TypeDef;

typedef struct
{
    uint8_t RESERVED0[128];
    union
    {
        __IO uint32_t RST;
        stc_wdt_rst_field_t RST_f;
    };
    union
    {
        __IO uint32_t CON;
        stc_wdt_con_field_t CON_f;
    };
}M0P_WDT_TypeDef;



